import 'dart:math';

class RandomValues {
  static final random = Random();
  static final notes = [
    "Набросать схему идеального утра",
    "Список из 10 книг на этот год",
    "Придумать название для блога",
    "Записать 3 бизнес-идеи с нуля",
    "Что я хочу успеть до конца месяца",
    "Маршрут выходного дня в другом районе",
    "5 мест для отпуска",
    "План тренировок на неделю",
    "10 вещей, за которые я благодарен",
    "Цитата, которая зацепила сегодня",
    "Плейлист для поднятия настроения",
    "Письмо себе через 5 лет",
    "3 привычки для внедрения за 21 день",
    "Чек-лист дел перед сном",
    "Список навыков для освоения",
    "Рецепт идеального завтрака",
    "Записать пароль (в шифре)",
    "Размеры одежды близких",
    "Список фильмов от друзей",
    "Одним предложением: чем сегодня день особенный",
  ];
  static final dates = [
    "12 03 2025",
    "28 07 2025",
    "04 11 2025",
    "19 02 2025",
    "30 09 2025",
    "15 12 2025",
    "06 05 2025",
    "22 08 2025",
    "17 01 2025",
    "09 10 2025",
    "14 01 2026",
    "25 04 2026",
    "03 06 2026",
    "07 02 2026",
    "19 05 2026",
    "11 03 2026",
    "01 07 2026",
    "24 06 2025",
    "10 04 2025",
    "17 07 2026",
  ];

  static String randomNote() {
    return notes[random.nextInt(notes.length - 1)].toString();
  }

  static String randomDate() {
    return dates[random.nextInt(dates.length)];
  }
}
